## DataFrame Exploration

In [2]:
import pandas as pd

In [3]:
titanic_df = pd.read_csv("Titanic_data.csv")

In [4]:
titanic_df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [5]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

## Specific Information

In [6]:
#dataframe.describe()
titanic_df[["Age","Fare"]].describe()

              Age        Fare
count  714.000000  891.000000
mean    29.699118   32.204208
std     14.526497   49.693429
min      0.420000    0.000000
25%     20.125000    7.910400
50%     28.000000   14.454200
75%     38.000000   31.000000
max     80.000000  512.329200

In [9]:
#dataframe.value_counts()
titanic_df.value_counts("Survived", normalize = True)

Survived
0    0.616162
1    0.383838
Name: proportion, dtype: float64

In [10]:
titanic_df[titanic_df["Sex"] == "male"].value_counts("Survived")

Survived
0    468
1    109
Name: count, dtype: int64

In [12]:
titanic_df[["Survived", "Sex"]].value_counts(ascending = True)

Survived  Sex
0         female     81
1         male      109
          female    233
0         male      468
Name: count, dtype: int64

In [14]:
titanic_df.value_counts(["Sex","Survived"], normalize = True)

Sex     Survived
male    0           0.525253
female  1           0.261504
male    1           0.122334
female  0           0.090909
Name: proportion, dtype: float64

Interestingly, survival rate of female is near to death population.

In [15]:
#dataframe.nunique() and dataframe.unique()

titanic_df["Embarked"].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [18]:
titanic_df["Embarked"].nunique(dropna = True)

3

In [22]:
#Dataframe.isna()
titanic_df.isna().sum() #< finding total null values in each columna

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [23]:
titanic_df.isna().sum().max()

np.int64(687)

In [31]:
#dataframe.groupby(by= ...)
group_by_gender= titanic_df[["Sex", "Fare","Age","Survived"]].groupby(by = "Sex")
group_by_gender.mean()

             Fare        Age  Survived
Sex
female  44.479818  27.915709  0.742038
male    25.523893  30.726645  0.188908

In [35]:
 group_by_embarked= titanic_df[[ "Fare","Age","Survived", "Embarked"]].groupby(by = "Embarked")

In [36]:
group_by_embarked.sum()

                Fare       Age  Survived
Embarked
C         10072.2962   4005.92        93
Q          1022.2543    786.50        30
S         17439.3988  16312.75       217

In [37]:
group_by_embarked.count()

          Fare  Age  Survived
Embarked
C          168  130       168
Q           77   28        77
S          644  554       644

In [38]:
group_by_embarked.mean()

               Fare        Age  Survived
Embarked
C         59.954144  30.814769  0.553571
Q         13.276030  28.089286  0.389610
S         27.079812  29.445397  0.336957

In [39]:
group_by_embarked= titanic_df[[ "Fare","Age","Survived", "Embarked"]].groupby(by = ["Embarked", "Survived"])

In [40]:
group_by_embarked.max()

                       Fare   Age
Embarked Survived
C        0         247.5208  71.0
         1         512.3292  60.0
Q        0          90.0000  70.5
         1          90.0000  33.0
S        0         263.0000  74.0
         1         263.0000  80.0

In [42]:
group_by_embarked.mean()

                        Fare        Age
Embarked Survived
C        0         35.443335  33.666667
         1         79.720926  28.973671
Q        0         13.335904  30.325000
         1         13.182227  22.500000
S        0         20.743987  30.203966
         1         39.547081  28.113184

In [43]:
## correlation

In [45]:
titanic_df[["Age","Fare"]].corr()

           Age      Fare
Age   1.000000  0.096067
Fare  0.096067  1.000000

In [47]:
titanic_df[["Age", "Fare"]].cov()

             Age         Fare
Age   211.019125    73.849030
Fare   73.849030  2469.436846

In [51]:
#sample
titanic_df.sample(frac =0.1, random_state = 99)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
247,248,1,2,"Hamalainen, Mrs. William (Anna)",female,24.0,0,2,250649,14.5000,NaN,S
823,824,1,3,"Moor, Mrs. (Beila)",female,27.0,0,1,392096,12.4750,E121,S
566,567,0,3,"Stoytcheff, Mr. Ilia",male,19.0,0,0,349205,7.8958,NaN,S
666,667,0,2,"Butler, Mr. Reginald Fenton",male,25.0,0,0,234686,13.0000,NaN,S
199,200,0,2,"Yrois, Miss. Henriette (""Mrs Harbeck"")",female,24.0,0,0,248747,13.0000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
509,510,1,3,"Lang, Mr. Fang",male,26.0,0,0,1601,56.4958,NaN,S
792,793,0,3,"Sage, Miss. Stella Anna",female,NaN,8,2,CA. 2343,69.5500,NaN,S
541,542,0,3,"Andersson, Miss. Ingeborg Constanzia",female,9.0,4,2,347082,31.2750,NaN,S
781,782,1,1,"Dick, Mrs. Albert Adrian (Vera Gillespie)",female,17.0,1,0,17474,57.0000,B20,S
350,351,0,3,"Odahl, Mr. Nils Martin",male,23.0,0,0,7267,9.2250,NaN,S